# Задача 30: Заполните массив элементами арифметической
# прогрессии. Её первый элемент, разность и количество
# элементов нужно ввести с клавиатуры. Формула для
# получения n-го члена прогрессии: a
# n = a1 + (n-1) * d.
# Каждое число вводится с новой строки.
# Ввод: 7 2 5
# Вывод: 7 9 11 13 15

a1 = int(input("Введите первый элемент массива: "))
d = int(input("Введите разность элементов массива: "))
n = int(input("Введите число элементов массива: "))

res = []
#  сгенерировали элементы массива
for i in range(n):
    an= a1 + i * d
    res.append(an)

print(res)

